[
    {
        "_id": "63d5cd6f487dc70f92ae78ae",
        "name": "F. Scott Fitzgerald",
        "born": "1896-09-24",
        "died": "1940-12-21",
        "nationality": "American",
        "occupation": "Novelist, Short-story writer",
        "works": [],
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8e/F._Scott_Fitzgerald_1921.jpg",
        "biography": "Francis Scott Fitzgerald was an American novelist, widely regarded as one of the greatest, if not the greatest, writers of the 20th century. He is best known for his novels The Great Gatsby and Tender is the Night, as well as his many short stories."
    },
    {
        "_id": "63d5cd6f487dc70f92ae78af",
        "name": "J.D. Salinger",
        "born": "1919-01-01",
        "died": "2010-01-27",
        "nationality": "American",
        "occupation": "Novelist, Short-story writer",
        "works": [],
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e1/JD_Salinger.jpg",
        "biography": "Jerome David Salinger was an American writer best known for his novel The Catcher in the Rye. He published several short stories in the 1940s and 1950s that were well-received, but he became reclusive in the last half of his life and published nothing after 1965."
    },
    {
        "_id": "63d5cd6f487dc70f92ae78b0",
        "name": "Harper Lee",
        "born": "1926-04-28",
        "died": "2016-02-19",
        "nationality": "American",
        "occupation": "Novelist",
        "works": [],
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Harper_Lee_NYWTS_3.jpg",
        "biography": "Nelle Harper Lee was an American novelist, known for her 1960 novel To Kill a Mockingbird. It won the Pulitzer Prize and has become a classic of modern American literature. The novel is widely taught in schools in the United States with more than 30 million copies sold worldwide."
    },
    {
        "_id": "63d5cd6f487dc70f92ae78b1",
        "name": "J.R.R. Tolkien",
        "born": "1892-01-03",
        "died": "1973-09-02",
        "nationality": "British",
        "occupation": "Novelist, Scholar, Poet",
        "works": [],
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Tolkien_1916.jpg",
        "biography": "John Ronald Reuel Tolkien was an English writer, poet, and scholar, best known as the author of the classic high-fantasy works The Hobbit and The Lord of the Rings. He was also a professor of Anglo-Saxon at Oxford University, and of English Language and Literature at Merton College, Oxford"
    },
    {
        "_id": "63d5cd6f487dc70f92ae78b2",
        "name": "J.K. Rowling",
        "born": "1965-07-31",
        "died": null,
        "nationality": "British",
        "occupation": "Author",
        "works": [],
        "image_url": "https://images.unsplash.com/photo-1516474930398-b2de2bce2b5e?ixlib=rb-1.2.1&auto=format&fit=crop&w=1050&q=80",
        "biography": "Joanne Rowling, is a British author, philanthropist, film producer, television producer, and screenwriter. She is best known for writing the Harry Potter fantasy series, which has won multiple awards and sold more than 500 million copies, becoming the best-selling book series in history. The books are the basis of a popular film series, over which Rowling had overall approval on the scripts."
    },
    {
        "_id": "63d5cd6f487dc70f92ae78b3",
        "name": "Anne Frank",
        "born": "1929-06-12",
        "died": "1945-03-31",
        "nationality": "German",
        "occupation": "Diary writer",
        "works": [],
        "image_url": "https://images.unsplash.com/photo-1571475368710-b8f8e9a9fcf1?ixlib=rb-1.2.1&auto=format&fit=crop&w=1050&q=80",
        "biography": "Anne Frank was a German-born Jewish girl who, along with her family and four other people, hid in the second and third floor rooms at the back of her father's Amsterdam company during the Nazi occupation of the Netherlands from June 12, 1942, to August 4, 1944. During this time, Anne wrote about her thoughts, feelings, and daily life in a diary, which was later published as The Diary of Anne Frank."
    },
    {
        "_id": "63d5cd6f487dc70f92ae78b4",
        "name": "Paulo Coelho",
        "born": "1947-08-24",
        "died": null,
        "nationality": "Brazilian",
        "occupation": "Author",
        "works": [],
        "image_url": "https://images.unsplash.com/photo-1498989610148-65f6f1b2f238?ixlib=rb-1.2.1&auto=format&fit=crop&w=1051&q=80",
        "biography": "Paulo Coelho is a Brazilian author, best known for his novels The Alchemist and Eleven Minutes, which have sold over 225 million copies worldwide and been translated into 80 languages. He is also a prominent blogger, having been listed by The Guardian as one of the top 100 most powerful people in the world of digital media."
    },
    {
        "_id": "63d5cd6f487dc70f92ae78b5",
        "name": "Ernest Hemingway",
        "born": "1899-07-21",
        "died": "1961-07-02",
        "nationality": "American",
        "occupation": "Novelist, short story writer, journalist",
        "works": [],
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Ernest_Hemingway_1923_passport_photo.jpg/440px-Ernest_Hemingway_1923_passport_photo.jpg",
        "biography": "Ernest Hemingway was an American novelist, short story writer, and journalist. His economical and understated style had a strong influence on 20th-century fiction, while his life of adventure and his public image influenced later generations. Hemingway produced most of his work between the mid-1920s and the mid-1950s, and he won the Nobel Prize in Literature in 1954. He published seven novels, six short story collections, and two non-fiction works. Three of his novels, four short story collections, and three non-fiction works were published posthumously. Many of his works are considered classics of American literature."
    },
    {
        "_id": "63d5cd6f487dc70f92ae78b6",
        "name": "Oscar Wilde",
        "born": "1854-10-16",
        "died": "1900-11-30",
        "nationality": "Irish",
        "occupation": "Writer, poet, playwright",
        "works": [],
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Oscar_Wilde_Sarony.jpg/440px-Oscar_Wilde_Sarony.jpg",
        "biography": "Oscar Wilde was an Irish writer, poet, and playwright. He is best known for his epigrams and plays, his novel The Picture of Dorian Gray, and the circumstances of his criminal conviction for homosexuality and early death. He was one of London's most popular playwrights in the early 1890s, and today is remembered for his epigrams, his only novel, The Picture of Dorian Gray, his plays, as well as the circumstances of his imprisonment and early death. Wilde's parents were successful Anglo-Irish intellectuals in Dublin. Their son became fluent in French and German early in life. At university, Wilde read Greats; he proved himself to be an outstanding classicist, first at Dublin, then at Oxford."
    }
]
