[
    {
        "name": "F. Scott Fitzgerald",
        "born": "September 24, 1896",
        "died": "December 21, 1940",
        "nationality": "American",
        "occupation": "Author, Screenwriter",
        "notable_works": [
            "The Great Gatsby",
            "This Side of Paradise",
            "The Beautiful and Damned"
        ],
        "image_url": "https://www.example.com/images/f_scott_fitzgerald.jpg",
        "biography": "Francis Scott Fitzgerald was an American novelist, essayist, screenwriter, and short-story writer. He is widely regarded as one of the greatest American writers of the 20th century. Fitzgerald's novels and short stories are distinguished by their idealism, a powerful sense of social and personal tragedy, and a wry humor. He is best known for his novel The Great Gatsby (1925), widely considered one of the greatest novels ever written."
    },
    {
        "name": "J.D. Salinger",
        "born": "January 1, 1919",
        "died": "January 27, 2010",
        "nationality": "American",
        "occupation": "Author, Screenwriter",
        "notable_works": [
            "The Catcher in the Rye",
            "Nine Stories",
            "Franny and Zooey"
        ],
        "image_url": "https://www.example.com/images/jd_salinger.jpg",
        "biography": "Jerome David Salinger was an American writer, known for his novel The Catcher in the Rye. The novel's antihero, Holden Caulfield, has become an icon for teenage rebellion and alienation. The novel was included on Time magazine's 2005 list of the 100 best English-language novels written since 1923 and it was named by Modern Library and its readers as one of the 100 best English-language novels of the 20th century. He published his final original work in 1965 and afterward led a reclusive lifestyle, only publishing a handful of short stories until his death in 2010."
    },
    {
        "name": "Harper Lee",
        "born": "April 28, 1926",
        "died": "February 19, 2016",
        "nationality": "American",
        "occupation": "Author",
        "notable_works": ["To Kill a Mockingbird"],
        "image_url": "https://www.example.com/images/harper_lee.jpg",
        "biography": "Nelle Harper Lee was an American novelist widely known for To Kill a Mockingbird, published in 1960. Immediately successful, it won the 1961 Pulitzer Prize and has become a classic of modern American literature. The plot and characters are loosely based on Lee's observations of her family, her neighbors and an event that occurred near her hometown of Monroeville, Alabama, in 1936, when she was 10 years old."
    },
    {
        "name": "J.R.R. Tolkien",
        "born": "January 3, 1892",
        "died": "September 2, 1973",
        "nationality": "British",
        "occupation": "Author, Philologist, University Professor",
        "notable_works": [
            "The Hobbit",
            "The Lord of the Rings",
            "The Silmarillion"
        ],
        "image_url": "https://www.example.com/images/jrr_tolkien.jpg",
        "biography": "John Ronald Reuel Tolkien, was an English writer, poet, and academic, who is best known as the author of the classic high-fantasy works The Hobbit and The Lord of the Rings. He was a close friend of C. S. Lewis—they were both members of the informal literary group known as the Inklings—and both authors were Catholic converts. Tolkien served as the Rawlinson and Bosworth Professor of Anglo-Saxon and Fellow of Pembroke College, Oxford, from 1925 to 1945 and Merton Professor of English Language and Literature and Fellow of Merton College, Oxford, from 1945 to 1959."
    },
    {
        "name": "J.K. Rowling",
        "born": "July 31, 1965",
        "died": null,
        "nationality": "British",
        "occupation": "Author, Screenwriter",
        "notable_works": ["Harry Potter series"],
        "image_url": "https://www.example.com/images/jk_rowling.jpg",
        "biography": "Joanne Rowling is a British author, philanthropist, film producer, television producer, and screenwriter. She is best known for writing the Harry Potter fantasy series, which won multiple awards and sold more than 500 million copies, becoming the best-selling book series in history. The books are the basis of a popular film series, over which Rowling had overall approval on the scripts and was a producer on the final films. She also writes crime novels under the pen name Robert Galbraith."
    },
    {
        "name": "Anne Frank",
        "born": "June 12, 1929",
        "died": "March 1945",
        "nationality": "German",
        "occupation": "Diary Writer",
        "notable_works": ["The Diary of Anne Frank"],
        "image_url": "https://www.example.com/images/anne_frank.jpg",
        "biography": "Anne Frank was a German-Dutch diarist. One of the most discussed Jewish victims of the Holocaust, she gained fame posthumously with the publication of The Diary of a Young Girl, in which she documents her life in hiding from 1942 to 1944, during the German occupation of the Netherlands in World War II. It is one of the world's most widely known books and has been the basis for several plays and films."
    },
    {
        "name": "Paulo Coelho",
        "born": "August 24, 1947",
        "died": null,
        "nationality": "Brazilian",
        "occupation": "Author, Lyricist",
        "notable_works": [
            "The Alchemist",
            "Eleven Minutes",
            "By the River Piedra I Sat Down and Wept"
        ],
        "image_url": "https://www.example.com/images/paulo_coelho.jpg",
        "biography": "Paulo Coelho is a Brazilian lyricist and novelist. He is the recipient of numerous international awards, amongst them the Crystal Award by the World Economic Forum. His novel The Alchemist has sold over 225 million copies worldwide, becoming one of the best-selling books in history and the all-time best-selling Portuguese-language book. He has been a member of the Brazilian Academy of Letters since 2002."
    },
    {
        "name": "Ernest Hemingway",
        "born": "July 21, 1899",
        "died": "July 2, 1961",
        "nationality": "American",
        "occupation": "Author, Journalist",
        "notable_works": [
            "The Old Man and the Sea",
            "For Whom the Bell Tolls",
            "A Farewell to Arms"
        ],
        "image_url": "https://www.example.com/images/ernest_hemingway.jpg",
        "biography": "Ernest Hemingway was an American journalist, novelist, and short-story writer. His economical and understated style—which he termed the iceberg theory—had a strong influence on 20th-century fiction, while his adventurous lifestyle and his public image brought him admiration from later generations. Hemingway produced most of his work between the mid-1920s and the mid-1950s, and he won the Nobel Prize in Literature in 1954. He published seven novels, six short-story collections, and two non-fiction works."
    },
    {
        "name": "Oscar Wilde",
        "born": "October 16, 1854",
        "died": "November 30, 1900",
        "nationality": "Irish",
        "occupation": "Author, Playwright, Poet",
        "notable_works": [
            "The Picture of Dorian Gray",
            "The Importance of Being Earnest",
            "The Ballad of Reading Gaol"
        ],
        "image_url": "https://www.example.com/images/oscar_wilde.jpg",
        "biography": "Oscar Wilde was an Irish poet and playwright. After writing in different forms throughout the 1880s, he became one of London's most popular playwrights in the early 1890s. Today he is remembered for his epigrams, his novel The Picture of Dorian Gray, his plays, as well as the circumstances of his imprisonment and early death. Wilde's parents were successful Anglo-Irish intellectuals in Dublin. Their son became fluent in French and German early in life."
    }
]
